src/Documents/ДанныеДокументаМЭДО/ДанныеДокументаМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеДокументаМЭДО</name>
  <comment>Контейнер загруженного/отправленного по МЭДО документа. И дополнительная детализация для МЭДО</comment>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>АрхивЭСД</name>
    <comment>Внутри ДвоичныеДанные</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМЭДО</name>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйФайл</name>
    <comment>Главный документ из сообщения, остальные - приложения к нему</comment>
    <type>
      <types>DefinedType.ПрисоединенныйФайлМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовКОтправке</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>DefinedType.ГрифДоступаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <comment>Для входящего - из паспорта сообщения, для исходящего - GUID из ссылки на документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяАрхиваЭСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоСоставления</name>
    <type>
      <types>CatalogRef.МестаСоставленияДокументовМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ОтветственныйМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееСостояние</name>
    <comment>Для отбора в списке</comment>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/НастройкиКонтрагентовМЭДО/НастройкиКонтрагентовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрагентовМЭДО</name>
  <resources>
    <name>АдресМЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияФорматаМЭДО</name>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДокументовМЭДО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИдентификаторДокумента</name>
    <comment>Для входящего - из паспорта сообщения МЭДО, для исходящего - наш GUID из ссылки на документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщения</name>
    <comment>Для входящего из электронного сообщения. Для исходящего - генерируется системой</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредметСообщения</name>
    <type>
      <types>DefinedType.ПредметСообщенияМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовМЭДО</types>
    </type>
  </resources>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/УровниСобытийМЭДО/УровниСобытийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниСобытийМЭДО</name>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Информация</name>
  </enumValues>
</mdclass:Enum>

src/Enums/НаправленияСообщенийМЭДО/НаправленияСообщенийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияСообщенийМЭДО</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументовМЭДО</name>
  <enumValues>
    <name>ВходящийДокументЗарегистрирован</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументЗарегистрированГотовКОтправке</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументОтправлен</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументПолучен</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ИсходящееУведомлениеЕщеНеОтправлено</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ИсходящийДокументЕщеНеОтправлен</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ОтправкаОтменена</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленаКвитанция</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленаКвитанцияОбОшибке</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ПолученаКвитанция</name>
    <comment>Для исходящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ПолученаКвитанцияОбОшибке</name>
    <comment>Для исходящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоУведомление</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>СозданаИсходящаяКвитанция</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>СозданоИсходящееУведомление</name>
    <comment>для входящих документов</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/ДанныеДокументаМЭДО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОтвета = МЭДОСтруктурыДанных.НовыйЛегкийОтвет();
	
	// Проверка на уникальность по полю документ, должен быть только один документ "Данные документа МЭДО":
	Если ЭтоНовый() Тогда
		ДанныеПоЭтомуЖеДокументу = Документы.ДанныеДокументаМЭДО.ПолучитьДанныеДокументаМЭДО(
			Документ, "Ссылка", ДанныеОтвета);
		Если ЗначениеЗаполнено(ДанныеПоЭтомуЖеДокументу.Ссылка) Тогда
			ТекстОшибкиПодробно = СтрШаблон(
				НСтр("ru = 'Попытка второй раз создать ""Данные документа МЭДО"", уже есть другой объект: %1'"),
				ДанныеПоЭтомуЖеДокументу.Ссылка);
			МЭДО.ЗаписьВЖурналСобытий(
				Перечисления.УровниСобытийМЭДО.Ошибка,
				ДанныеПоЭтомуЖеДокументу.Ссылка,
				НСтр("ru = 'Ошибка при записи ""Данных документа МЭДО""'"),
				ТекстОшибкиПодробно,
				ДанныеОтвета);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Ответственный = ИнтеграцияСМЭДО.ТекущийОтветственный();
	
	// Пометка удаления должна быть такая же, как у родительского документа:
	ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ПометкаУдаления");
	
	Если Не ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	
	// Часть реквизитов можно достать сразу из родительского документа:
	Если ИнтеграцияСМЭДО.ЭтоИсходящийДокумент(Документ) Тогда
		РеквизитыДокумента = ИнтеграцияСМЭДО.ПолучитьТребуемыеДанныеИсходящегоДокумента(
			Документ, "Организация, Контрагенты, ГрифДоступа, ДатаСоздания, ДатаРегистрации");
		Дата = РеквизитыДокумента.ДатаСоздания;
		ГрифДоступа = РеквизитыДокумента.ГрифДоступа;
		Организация = РеквизитыДокумента.Организация;
		
		// Определяем версию для отправки, достаточно хотя бы у одного контрагента, если не проставлено, 
		// то останется по умолчанию:
		Если Не ЗначениеЗаполнено(ВерсияМЭДО) Тогда
			ВерсияМЭДО = Перечисления.ВерсииФорматаМЭДО.ПоследняяВерсия();
			Для Каждого СтруктураКонтрагент Из РеквизитыДокумента.Контрагенты Цикл
				НастройкиКонтрагента = РегистрыСведений.НастройкиКонтрагентовМЭДО.ПолучитьНастройки(
					СтруктураКонтрагент.Контрагент, ДанныеОтвета);
				Если ДанныеОтвета.Успех Тогда
					МЭДО.ПрисвоитьЗаполненное(ВерсияМЭДО, НастройкиКонтрагента.ВерсияФорматаМЭДО);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее;
		МЭДО.ПрисвоитьЗаполненное(ДатаРегистрации, РеквизитыДокумента.ДатаРегистрации);
	КонецЕсли;
	
	Если ИнтеграцияСМЭДО.ЭтоВходящийДокумент(Документ) Тогда
		РеквизитыДокумента = ИнтеграцияСМЭДО.ПолучитьТребуемыеДанныеВходящегоДокумента(
			Документ, "Организация, Контрагент, ГрифДоступа, ДатаСоздания, ДатаРегистрации");
		Дата = РеквизитыДокумента.ДатаСоздания;
		ГрифДоступа = РеквизитыДокумента.ГрифДоступа;
		Организация = РеквизитыДокумента.Организация;
		
		// Определяем версию для отправки по контрагенту, если не проставлено, 
		// то останется по умолчанию:
		Если Не ЗначениеЗаполнено(ВерсияМЭДО) Тогда
			ВерсияМЭДО = Перечисления.ВерсииФорматаМЭДО.ПоследняяВерсия();
			НастройкиКонтрагента = РегистрыСведений.НастройкиКонтрагентовМЭДО.ПолучитьНастройки(
				РеквизитыДокумента.Контрагент, ДанныеОтвета);
			Если ДанныеОтвета.Успех Тогда
				МЭДО.ПрисвоитьЗаполненное(ВерсияМЭДО, НастройкиКонтрагента.ВерсияФорматаМЭДО);
			КонецЕсли;
		КонецЕсли;
		
		Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее;
		МЭДО.ПрисвоитьЗаполненное(ДатаРегистрации, РеквизитыДокумента.ДатаРегистрации);
	КонецЕсли;
	
	Если Отправлен И Не ЗначениеЗаполнено(ДатаРегистрации) Тогда
		МЭДО.ЗаписьВЖурналСобытий(
			Перечисления.УровниСобытийМЭДО.Ошибка,
			Ссылка,
			НСтр("ru = 'Ошибка при записи ""Данных документа МЭДО""'"),
			НСтр("ru = 'Незарегистрированный документ не может быть отправлен!'"),
			ДанныеОтвета);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ГлавныйФайл) Тогда
		ГлавныйФайл = МЭДО.ПопытатьсяОпределитьГлавныйФайл(Документ);
	КонецЕсли;
	
	
	Если Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
		// Для исходящего документа присвоим свой идентификатор из ссылки на документ:
		Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
			ИдентификаторДокумента = "" + Документ.УникальныйИдентификатор();
		КонецЕсли;
		
		// Для исходящего сообщения аналогично, но из ссылки на "Данные документа МЭДО", даже если это новый объект:
		Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
			ИдентификаторСообщения = "" + ИнтеграцияСМЭДО.СсылкаНовогоОбъекта(ЭтотОбъект).УникальныйИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СостоянияДокументовМЭДО.Записывать = Истина;
	
	Движение = Движения.СостоянияДокументовМЭДО.Добавить();
	ЗаполнитьЗначенияСвойств(
		Движение, ЭтотОбъект, "Направление, Документ, ИдентификаторДокумента, ИдентификаторСообщения");
	
	Движение.Период = Дата;
	Движение.ПредметСообщения = Ссылка;
	
	Состояние2 = Неопределено;
	Если Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
		
		Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ИсходящийДокументЕщеНеОтправлен;
		
		Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
			Если Отправлен Тогда
				Состояние2 = Перечисления.СостоянияДокументовМЭДО.ДокументОтправлен;
			ИначеЕсли ГотовКОтправке И ЗначениеЗаполнено(ДатаРегистрации) Тогда 
				Состояние2 = Перечисления.СостоянияДокументовМЭДО.ДокументЗарегистрированГотовКОтправке;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее Тогда
		
		Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ДокументПолучен;
		
		Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
			Состояние2 = Перечисления.СостоянияДокументовМЭДО.ВходящийДокументЗарегистрирован;
		КонецЕсли;
	КонецЕсли;
	
	// Второе движение
	Если ЗначениеЗаполнено(Состояние2) Тогда
		Движение = Движения.СостоянияДокументовМЭДО.Добавить();
		Движение.Период = ДатаРегистрации;
		Движение.ПредметСообщения = Ссылка;
		ЗаполнитьЗначенияСвойств(
			Движение, ЭтотОбъект, "Направление, Документ, ИдентификаторДокумента, ИдентификаторСообщения");
		Движение.Состояние = Состояние2;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе

#Область Инициализация
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецОбласти

#КонецЕсли
